
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Highly Available · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="clustering.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    开始
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    消息队列模式
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../queue/hello_world.html">
            
                <a href="../queue/hello_world.html">
            
                    
                    Hello World
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../queue/work_queues.html">
            
                <a href="../queue/work_queues.html">
            
                    
                    Work queues
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../queue/publish_subscribe.html">
            
                <a href="../queue/publish_subscribe.html">
            
                    
                    Publish / Subscribe 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../queue/routing.html">
            
                <a href="../queue/routing.html">
            
                    
                    Routing
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../queue/topics.html">
            
                <a href="../queue/topics.html">
            
                    
                    Topics
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="../queue/rpc.html">
            
                <a href="../queue/rpc.html">
            
                    
                    RPC
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="../queue/publisher_confirms.html">
            
                <a href="../queue/publisher_confirms.html">
            
                    
                    Publisher Confirms
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    分布式RabbitMQ(Distributed RabbitMQ)
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="overview.html">
            
                <a href="overview.html">
            
                    
                    Mirroring, Shovel, Federation Overview
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="clustering.html">
            
                <a href="clustering.html">
            
                    
                    Clustering
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.1.3" data-path="highly_available.html">
            
                <a href="highly_available.html">
            
                    
                    Highly Available
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Highly Available</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x9AD8;&#x53EF;&#x7528;&#x961F;&#x5217;highly-available-mirrored-queues">&#x9AD8;&#x53EF;&#x7528;&#x961F;&#x5217;(Highly Available (Mirrored) Queues)</h3>
<h3 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h3>
<blockquote>
<h2 id="overview"><a href="https://www.rabbitmq.com/ha.html#overview" target="_blank">Overview</a></h2>
<p>This guide covers mirroring (queue contents replication) of classic queues. <a href="https://www.rabbitmq.com/quorum-queues.html" target="_blank">Quorum queues</a> is an alternative queue type that offers replication and focuses on data safety. In many cases quorum queues would be a superior option to classic queue mirroring. Readers are encouraged to get familiar with quorum queues as well as the contents of this guide.</p>
</blockquote>
<p>&#x672C;&#x7BC7;&#x5305;&#x542B;&#x4E86;&#x7ECF;&#x5178;&#x7684;&#x955C;&#x50CF;&#x961F;&#x5217;&#x3002;&#x4EF2;&#x88C1;&#x961F;&#x5217;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x7684;&#x961F;&#x5217;&#x7C7B;&#x578B;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x590D;&#x5236;&#x5E76;&#x6CE8;&#x91CD;&#x6570;&#x636E;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x5728;&#x591A;&#x79CD;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x4EF2;&#x88C1;&#x961F;&#x5217;&#x76F8;&#x6BD4;&#x955C;&#x50CF;&#x961F;&#x5217;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<h4 id="&#x4EC0;&#x4E48;&#x662F;&#x955C;&#x50CF;&#x961F;&#x5217;">&#x4EC0;&#x4E48;&#x662F;&#x955C;&#x50CF;&#x961F;&#x5217;</h4>
<h4 id="what-is-queue-mirroring"><a href="https://www.rabbitmq.com/ha.html#what-is-mirroring" target="_blank">What is Queue Mirroring</a></h4>
<blockquote>
<p>By default, contents of a queue within a RabbitMQ cluster are located on a single node (the node on which the queue was declared). This is in contrast to exchanges and bindings, which can always be considered to be on all nodes. Queues can optionally be made <em>mirrored</em> across multiple nodes.</p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;RabbitMQ&#x96C6;&#x7FA4;&#x4E2D;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x4F4D;&#x4E8E;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;(&#x58F0;&#x660E;&#x8FD9;&#x4E2A;&#x961F;&#x5217;&#x7684;&#x8282;&#x70B9;&#x4E0A;)&#xFF0C;&#x8FD9;&#x8DDF;exchanges&#x548C;bindings&#x662F;&#x76F8;&#x53CD;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5728;&#x6240;&#x6709;&#x8282;&#x70B9;&#x4E0A;&#x3002;&#x8DE8;&#x8D8A;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x961F;&#x5217;&#x53EF;&#x4EE5;&#x53EF;&#x9009;&#x7684;&#x88AB;&#x8BBE;&#x7F6E;&#x6210;&#x955C;&#x50CF;&#x961F;&#x5217;&#x3002;</p>
<p>Each mirrored queue consists of one <em>master</em> and one or more <em>mirrors</em>. The master is hosted on one node commonly referred as the master node. Each queue has its own master node. All operations for a given queue are first applied on the queue&apos;s master node and then propagated to mirrors. This involves enqueueing publishes, delivering messages to consumers, tracking <a href="https://www.rabbitmq.com/confirms.html" target="_blank">acknowledgements from consumers</a> and so on.</p>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x955C;&#x50CF;&#x961F;&#x5217;&#x5305;&#x542B;&#x4E00;&#x4E2A;master&#x548C;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x955C;&#x50CF;&#xFF0C;&#x4E3B;&#x8282;&#x70B9;&#x6258;&#x7BA1;&#x5728;&#x4E00;&#x4E2A;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E2A;&#x961F;&#x5217;&#x90FD;&#x6709;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x53D1;&#x5F80;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x4F1A;&#x9996;&#x5148;&#x53D1;&#x5230;&#x961F;&#x5217;&#x7684;&#x4E3B;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4F20;&#x64AD;&#x5230;&#x955C;&#x50CF;&#xFF0C;&#x8FD9;&#x6D89;&#x53CA;&#x5230;&#x53D1;&#x5E03;&#x3001;&#x4F20;&#x9012;&#x6D88;&#x606F;&#x7ED9;&#x6D88;&#x8D39;&#x8005;&#x3001;&#x8FFD;&#x8E2A;&#x6765;&#x81EA;&#x6D88;&#x8D39;&#x8005;&#x7684;ack&#xFF0C;&#x7B49;&#x7B49;</p>
<p>Queue mirroring implies <a href="https://www.rabbitmq.com/clustering.html" target="_blank">a cluster of nodes</a>. It is therefore not recommended for use across a WAN (though of course, clients can still connect from as near and as far as needed).</p>
<p>&#x961F;&#x5217;&#x955C;&#x50CF;&#x610F;&#x5473;&#x7740;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x96C6;&#x7FA4;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0D;&#x5EFA;&#x8BAE;&#x8DE8;WAN&#x4F7F;&#x7528;&#x5B83;(&#x5F53;&#x7136;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8FDC;&#x8FD1;&#x8FDE;&#x63A5;)&#x3002;</p>
<p>Messages published to the queue are replicated to all mirrors. Consumers are connected to the master regardless of which node they connect to, with mirrors dropping messages that have been acknowledged at the master. Queue mirroring therefore enhances availability, but does not distribute load across nodes (all participating nodes each do all the work).</p>
<p>&#x53D1;&#x5E03;&#x5230;&#x961F;&#x5217;&#x7684;&#x6240;&#x6709;&#x6D88;&#x606F;&#x4F1A;&#x88AB;&#x590D;&#x5236;&#x5230;&#x6240;&#x6709;&#x955C;&#x50CF;&#x3002;&#x65E0;&#x8BBA;&#x8FDE;&#x63A5;&#x5230;&#x54EA;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x90FD;&#x5C06;&#x88AB;&#x8FDE;&#x63A5;&#x5230;&#x4E3B;&#x961F;&#x5217;&#xFF0C;&#x955C;&#x50CF;&#x5C06;&#x4E22;&#x5F03;&#x5728;&#x4E3B;&#x961F;&#x5217;&#x4E0A;&#x5DF2;&#x786E;&#x8BA4;&#x7684;&#x6D88;&#x606F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x961F;&#x5217;&#x955C;&#x50CF;&#x589E;&#x5F3A;&#x4E86;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x4F46;&#x4E0D;&#x8DE8;&#x8282;&#x70B9;&#x5206;&#x914D;&#x8D1F;&#x8F7D;(&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8282;&#x70B9;&#x90FD;&#x627F;&#x62C5;&#x6240;&#x6709;&#x5DE5;&#x4F5C;)&#x3002;</p>
<p>If the node that hosts queue master fails, the oldest mirror will be promoted to the new master as long as it synchronised. <a href="https://www.rabbitmq.com/ha.html#unsynchronised-mirrors" target="_blank">Unsynchronised mirrors</a> can be promoted, too, depending on queue mirroring parameters.</p>
<p>&#x5982;&#x679C;&#x8282;&#x70B9;&#x7684;&#x4E3B;&#x961F;&#x5217;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x6700;&#x957F;&#x7684;&#x955C;&#x50CF;&#x961F;&#x5217;&#x4F1A;&#x88AB;&#x63A8;&#x9009;&#x4E3A;&#x65B0;&#x7684;&#x4E3B;&#x961F;&#x5217;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x540C;&#x6B65;&#x4E86;&#x5168;&#x90E8;&#x6570;&#x636E;&#x3002;&#x672A;&#x540C;&#x6B65;&#x7684;&#x955C;&#x50CF;&#x4E5F;&#x80FD;&#x88AB;&#x63A8;&#x9009;&#xFF0C;&#x4F9D;&#x8D56;&#x4E8E;&#x955C;&#x50CF;&#x961F;&#x5217;&#x7684;&#x53C2;&#x6570;&#x3002;</p>
<p>There are multiple terms commonly used to identify primary and secondary replicas in a distributed system. This guide typically uses &quot;master&quot; to refer to the primary replica of a queue and &quot;mirror&quot; for secondary replicas. However, RabbitMQ CLI tools historically have been using the term &quot;slave&quot; to refer to secondaries. Therefore that term still appears in column names in CLI tools for backwards compatibility but will eventually be replaced.</p>
<p>&#x901A;&#x5E38;&#x6709;&#x591A;&#x4E2A;&#x672F;&#x8BED;&#x7528;&#x4E8E;&#x6807;&#x8BC6;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E3B;&#x526F;&#x672C;&#x548C;&#x8F85;&#x52A9;&#x526F;&#x672C;&#x3002;&#x672C;&#x6587;&#x6863;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x201C;master&#x201D;&#x6765;&#x6307;&#x4EE3;&#x961F;&#x5217;&#x7684;&#x4E3B;&#x526F;&#x672C;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x201C;mirror&#x201D;&#x6765;&#x6307;&#x4EE3;&#x8F85;&#x52A9;&#x526F;&#x672C;&#x3002;&#x4F46;&#x662F;&#xFF0C;RabbitMQ CLI&#x5DE5;&#x5177;&#x5728;&#x5386;&#x53F2;&#x4E0A;&#x4E00;&#x76F4;&#x4F7F;&#x7528;&#x672F;&#x8BED;&#x201C;slave&#x201D;&#x6765;&#x6307;&#x4EE3;&#x6B21;&#x8981;&#x5BF9;&#x8C61;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8BE5;&#x672F;&#x8BED;&#x4ECD;&#x663E;&#x793A;&#x5728;CLI&#x5DE5;&#x5177;&#x7684;&#x5217;&#x540D;&#x4E2D;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x5411;&#x540E;&#x517C;&#x5BB9;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x5C06;&#x88AB;&#x66FF;&#x6362;&#x3002;</p>
</blockquote>
<h4 id="&#x5982;&#x4F55;&#x914D;&#x7F6E;&#x955C;&#x50CF;&#x961F;&#x5217;">&#x5982;&#x4F55;&#x914D;&#x7F6E;&#x955C;&#x50CF;&#x961F;&#x5217;</h4>
<h5 id="how-mirroring-is-configured"><a href="https://www.rabbitmq.com/ha.html#ways-to-configure" target="_blank">How Mirroring is Configured</a></h5>
<blockquote>
<p>Mirroring parameters are configured using <a href="https://www.rabbitmq.com/parameters.html#policies" target="_blank">policies</a>. A policy matches one or more queues by name (using a regular expression pattern) and contains a definition (a map of optional arguments) that are added to the total set of properties of the matching queues.</p>
<p>Please see <a href="https://www.rabbitmq.com/parameters.html#policies" target="_blank">Runtime Parameters and Policies</a> for more information on policies.</p>
</blockquote>
<p>&#x4F7F;&#x7528;<code>policies</code>&#x914D;&#x7F6E;&#x955C;&#x50CF;&#x53C2;&#x6570;&#x3002;&#x4E00;&#x4E2A;&#x7B56;&#x7565;&#x6309;&#x540D;&#x79F0;&#x5339;&#x914D;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x961F;&#x5217;&#xFF08;&#x4F7F;&#x7528;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x6A21;&#x5F0F;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#xFF08;&#x53EF;&#x9009;&#x53C2;&#x6570;&#x7684;dict&#xFF09;&#xFF0C;&#x8BE5;&#x5B9A;&#x4E49;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x5339;&#x914D;&#x961F;&#x5217;&#x7684;&#x5168;&#x90E8;&#x5C5E;&#x6027;&#x4E2D;&#x3002;</p>
<h4 id="&#x63A7;&#x5236;&#x955C;&#x50CF;&#x7684;&#x961F;&#x5217;&#x53C2;&#x6570;">&#x63A7;&#x5236;&#x955C;&#x50CF;&#x7684;&#x961F;&#x5217;&#x53C2;&#x6570;</h4>
<h5 id="queue-arguments-that-control-mirroring"><a href="https://www.rabbitmq.com/ha.html#mirroring-arguments" target="_blank">Queue Arguments that Control Mirroring</a></h5>
<blockquote>
<p>As we&apos;ve covered above, queues have mirroring enabled via <a href="https://www.rabbitmq.com/parameters.html#policies" target="_blank">policy</a>. Policies can change at any time; it is valid to create a non-mirrored queue, and then make it mirrored at some later point (and vice versa). There is a difference between a non-mirrored queue and a mirrored queue which does not have any mirrors - the former lacks the extra mirroring infrastructure and will likely provide higher throughput.</p>
<p>You should be aware of the behaviour of <a href="https://www.rabbitmq.com/ha.html#unsynchronised-mirrors" target="_blank">adding mirrors to a queue</a>.</p>
<p>To cause queues to become mirrored, you need to create a policy which matches them and sets policy keys ha-mode and (optionally) ha-params. The following table explains the options for these keys:</p>
</blockquote>
<p>&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x961F;&#x5217;&#x901A;&#x8FC7;<code>policy</code>&#x542F;&#x7528;&#x4E86;&#x955C;&#x50CF;&#x3002;policy&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x66F4;&#x6539;&#xFF1B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x975E;&#x955C;&#x50CF;&#x961F;&#x5217;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x4EE5;&#x540E;&#x53EF;&#x4EE5;&#x518D;&#x542F;&#x52A8;&#x955C;&#x50CF;&#xFF08;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#xFF09;&#x3002;&#x975E;&#x955C;&#x50CF;&#x961F;&#x5217;&#x4E0E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x955C;&#x50CF;&#x7684;&#x955C;&#x50CF;&#x961F;&#x5217;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x533A;&#x522B;-&#x524D;&#x8005;&#x7F3A;&#x5C11;&#x989D;&#x5916;&#x7684;&#x955C;&#x50CF;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x63D0;&#x4F9B;&#x66F4;&#x9AD8;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x521B;&#x5EFA;&#x955C;&#x50CF;&#x961F;&#x5217;&#xFF0C;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E0E;&#x961F;&#x5217;&#x5339;&#x914D;&#x7684;&#x7B56;&#x7565;&#x5E76;&#x8BBE;&#x7F6E;&#x7B56;&#x7565;&#x53C2;&#x6570;<code>ha-mode</code>&#x548C;<code>ha-params</code>&#xFF08;&#x53EF;&#x9009;&#xFF09;&#x3002;&#x4E0B;&#x8868;&#x89E3;&#x91CA;&#x4E86;&#x8FD9;&#x4E9B;&#x53EF;&#x9009;&#x53C2;&#x6570;&#x7684;&#x542B;&#x4E49;&#xFF1A;</p>
<table>
<thead>
<tr>
<th style="text-align:left">ha-mode</th>
<th style="text-align:left">ha-params</th>
<th style="text-align:left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">exactly</td>
<td style="text-align:left"><em>count</em></td>
<td style="text-align:left">Number of queue replicas (master plus mirrors) in the cluster. A <em>count</em> value of 1 means a single replica: just the queue master. If the node running the queue master becomes unavailable, <a href="https://www.rabbitmq.com/ha.html#non-mirrored-queue-behavior-on-node-failure" target="_blank">the behaviour depends on queue durability</a>. A <em>count</em> value of 2 means 2 replicas: 1 queue master and 1 queue mirror. In other words: <code>NumberOfQueueMirrors = NumberOfNodes - 1</code>. If the node running the queue master becomes unavailable, the queue mirror will be automatically promoted to master according to the <a href="https://www.rabbitmq.com/ha.html#unsynchronised-mirrors" target="_blank">mirror promotion strategy</a> configured. If there are fewer than <em>count</em> nodes in the cluster, the queue is mirrored to all nodes. If there are more than <em>count</em> nodes in the cluster, and a node containing a mirror goes down, then a new mirror will be created on another node. Use of <code>exactly</code> mode with <a href="https://www.rabbitmq.com/ha.html#cluster-shutdown" target="_blank"><code>&quot;ha-promote-on-shutdown&quot;: &quot;always&quot;</code></a> can be dangerous since queues can migrate across a cluster and become unsynced as it is brought down.<br><br>&#x96C6;&#x7FA4;&#x4E2D;&#x961F;&#x5217;&#x526F;&#x672C;&#x7684;&#x4E2A;&#x6570;(master+mirrors)&#xFF0C;&#x5982;&#x679C;<code>count</code>&#x662F;1&#xFF0C;&#x4EE3;&#x8868;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x5373;&#x4E3B;&#x961F;&#x5217;&#xFF0C;&#x5982;&#x679C;&#x8FD0;&#x884C;&#x4E3B;&#x961F;&#x5217;&#x7684;&#x8282;&#x70B9;&#x51FA;&#x6545;&#x969C;&#x4E86;&#xFF0C;&#x53EA;&#x80FD;&#x4F9D;&#x9760;&#x961F;&#x5217;&#x7684;&#x6301;&#x4E45;&#x5316;&#x3002;&#x5982;&#x679C;<code>count</code>&#x662F;2&#xFF0C;&#x4EE3;&#x8868;&#x6709;&#x4E24;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x4E00;&#x4E2A;&#x4E3B;&#x961F;&#x5217;&#xFF0C;&#x4E00;&#x4E2A;&#x955C;&#x50CF;&#x961F;&#x5217;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;<code>NumberOfQueueMirrors = NumberOfNodes - 1</code>&#xFF0C;&#x5982;&#x679C;&#x8FD0;&#x884C;&#x4E3B;&#x961F;&#x5217;&#x7684;&#x8282;&#x70B9;&#x6545;&#x969C;&#x4E86;&#xFF0C;&#x955C;&#x50CF;&#x961F;&#x5217;&#x4F1A;&#x6839;&#x636E;&#x914D;&#x7F6E;&#x7684;&#x955C;&#x50CF;&#x63A8;&#x9009;&#x7B56;&#x7565;&#x88AB;&#x81EA;&#x52A8;&#x7684;&#x63A8;&#x9009;&#x4E3A;&#x4E3B;&#x961F;&#x5217;&#x3002;&#x5982;&#x679C;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#x6570;&#x5C0F;&#x4E8E;<code>count</code>&#xFF0C;&#x961F;&#x5217;&#x4F1A;&#x88AB;&#x955C;&#x50CF;&#x5230;&#x6240;&#x6709;&#x8282;&#x70B9;&#x3002;&#x5982;&#x679C;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#x6570;&#x5927;&#x4E8E;<code>count</code>&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x955C;&#x50CF;&#x961F;&#x5217;&#x51FA;&#x6545;&#x969C;&#x4E86;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E0A;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x955C;&#x50CF;&#x961F;&#x5217;&#x3002;&#x4F7F;&#x7528;exactly&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;<code>ha-promote-on-shutdown</code>&#x7684;&#x503C;&#x4E3A;<code>always</code>&#x4F1A;&#x5F88;&#x5371;&#x9669;&#xFF0C;&#x56E0;&#x4E3A;&#x961F;&#x5217;&#x53EF;&#x4EE5;&#x8DE8;&#x96C6;&#x7FA4;&#x8FC1;&#x79FB;&#xFF0C;&#x5E76;&#x5728;&#x5173;&#x95ED;&#x65F6;&#x53D8;&#x6210;&#x672A;&#x540C;&#x6B65;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">all</td>
<td style="text-align:left">(none)</td>
<td style="text-align:left">Queue is mirrored across all nodes in the cluster. When a new node is added to the cluster, the queue will be mirrored to that node. This setting is very conservative. Mirroring to a quorum (N/2 + 1) of cluster nodes is <a href="https://www.rabbitmq.com/ha.html#replication-factor" target="_blank">recommended instead</a>. Mirroring to all nodes will put additional strain on all cluster nodes, including network I/O, disk I/O and disk space usage.<br><br>&#x961F;&#x5217;&#x4F1A;&#x88AB;&#x955C;&#x50CF;&#x5230;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#xFF0C;&#x5F53;&#x96C6;&#x7FA4;&#x4E2D;&#x65B0;&#x52A0;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x961F;&#x5217;&#x5C06;&#x4F1A;&#x88AB;&#x955C;&#x50CF;&#x5230;&#x8BE5;&#x8282;&#x70B9;&#x3002;&#xFF1F;&#x3002;&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x5F88;&#x4FDD;&#x5B88;&#xFF0C;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x955C;&#x50CF;&#x5230;N/2 + 1&#x4E2A;&#x96C6;&#x7FA4;&#x8282;&#x70B9;&#x3002;&#x955C;&#x50CF;&#x5230;&#x6240;&#x6709;&#x8282;&#x70B9;&#x4F1A;&#x7ED9;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#x589E;&#x52A0;&#x989D;&#x5916;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x5305;&#x62EC;&#x7F51;&#x7EDC;IO&#xFF0C;&#x78C1;&#x76D8;IO&#xFF0C;&#x786C;&#x76D8;&#x7A7A;&#x95F4;&#x5360;&#x7528;</td>
</tr>
<tr>
<td style="text-align:left">nodes</td>
<td style="text-align:left"><em>node names</em></td>
<td style="text-align:left">Queue is mirrored to the nodes listed in <em>node names</em>. Node names are the Erlang node names as they appear in rabbitmqctl cluster_status; they usually have the form &quot;<code>rabbit@hostname</code>&quot;. If any of those node names are not a part of the cluster, this does not constitute an error. If none of the nodes in the list are online at the time when the queue is declared then the queue will be created on the node that the declaring client is connected to.<br><br>&#x961F;&#x5217;&#x4F1A;&#x88AB;&#x955C;&#x50CF;&#x5230;&#x6240;&#x6709;&#x5217;&#x51FA;&#x7684;<code>node names</code>&#x4E2D;&#xFF0C;&#x8282;&#x70B9;&#x540D;&#x5B57;&#x662F;&#x5728;<code>rabbitmqctl cluster_status</code>&#x4E2D;&#x663E;&#x793A;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x683C;&#x5F0F;&#x901A;&#x5E38;&#x662F;<code>rabbit@hostname</code>&#x3002;&#x5982;&#x679C;node names &#x91CC;&#x9762;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x4E0D;&#x5728;&#x96C6;&#x7FA4;&#x91CC;&#x9762;&#xFF0C;&#x8FD9;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x5728;&#x58F0;&#x660E;&#x961F;&#x5217;&#x65F6;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x4E0D;&#x5728;&#x7EBF;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x5728;&#x58F0;&#x660E;&#x5BA2;&#x6237;&#x7AEF;&#x8FDE;&#x63A5;&#x5230;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x521B;&#x5EFA;&#x961F;&#x5217;&#x3002;</td>
</tr>
</tbody>
</table>
<blockquote>
<p>Whenever the HA policy for a queue changes it will endeavour to keep its existing mirrors as far as this fits with the new policy.</p>
</blockquote>
<p>&#x6BCF;&#x5F53;&#x961F;&#x5217;&#x7684;HA&#x7B56;&#x7565;&#x53D1;&#x751F;&#x66F4;&#x6539;&#x65F6;&#xFF0C;&#x5B83;&#x90FD;&#x5C06;&#x52AA;&#x529B;&#x4F7F;&#x73B0;&#x6709;&#x7684;&#x955C;&#x50CF;&#x5C3D;&#x53EF;&#x80FD;&#x4E0E;&#x65B0;&#x7B56;&#x7565;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;</p>
<h4 id="&#x955C;&#x50CF;&#x4E2A;&#x6570;&#x7684;&#x6700;&#x4F73;&#x9009;&#x62E9;">&#x955C;&#x50CF;&#x4E2A;&#x6570;&#x7684;&#x6700;&#x4F73;&#x9009;&#x62E9;</h4>
<h5 id="replication-factor-how-many-mirrors-are-optimal"><a href="https://www.rabbitmq.com/ha.html#replication-factor" target="_blank">Replication Factor: How Many Mirrors are Optimal?</a></h5>
<blockquote>
<p>Mirroring to all nodes is the most conservative option. It will put additional strain on all cluster nodes, including network I/O, disk I/O and disk space usage. Having a replica on every node is unnecessary in most cases.</p>
<p>For clusters of 3 and more nodes it is recommended to replicate to a quorum (the majority) of nodes, e.g. 2 nodes in a 3 node cluster or 3 nodes in a 5 node cluster.</p>
<p>Since some data can be inherently transient or very time sensitive, it can be perfectly reasonable to use a lower number of mirrors for some queues (or even not use any mirroring).</p>
</blockquote>
<p>&#x5728;&#x96C6;&#x7FA4;&#x6240;&#x6709;&#x8282;&#x70B9;&#x4E0A;&#x955C;&#x50CF;&#x662F;&#x6700;&#x4FDD;&#x5B88;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x7ED9;&#x6240;&#x6709;&#x7684;&#x96C6;&#x7FA4;&#x8282;&#x70B9;&#x5E26;&#x6765;&#x989D;&#x5916;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x4E48;&#x505A;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;3&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x96C6;&#x7FA4;&#xFF0C;&#x63A8;&#x8350;&#x955C;&#x50CF;&#x5230;N/2 + 1&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x6BD4;&#x5982;3&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x7684;2&#x4E2A;&#xFF0C;5&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x7684;3&#x4E2A;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5929;&#x751F;&#x662F;&#x77ED;&#x6682;&#x7684;&#x6216;&#x5BF9;&#x65F6;&#x95F4;&#x975E;&#x5E38;&#x654F;&#x611F;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x67D0;&#x4E9B;&#x961F;&#x5217;&#x4F7F;&#x7528;&#x8F83;&#x5C11;&#x6570;&#x91CF;&#x7684;&#x955C;&#x50CF;&#x662F;&#x5B8C;&#x5168;&#x5408;&#x7406;&#x7684;(&#x751A;&#x81F3;&#x4E0D;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x955C;&#x50CF;)&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="clustering.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Clustering">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Highly Available","level":"2.1.3","depth":2,"previous":{"title":"Clustering","level":"2.1.2","depth":2,"path":"distribute/clustering.md","ref":"distribute/clustering.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"distribute/highly_available.md","mtime":"2020-04-24T03:43:26.381Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-24T03:48:12.552Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

