
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Publish / Subscribe  · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="routing.html" />
    
    
    <link rel="prev" href="work_queues.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    开始
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    消息队列模式
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="hello_world.html">
            
                <a href="hello_world.html">
            
                    
                    Hello World
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="work_queues.html">
            
                <a href="work_queues.html">
            
                    
                    Work queues
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.3" data-path="publish_subscribe.html">
            
                <a href="publish_subscribe.html">
            
                    
                    Publish / Subscribe 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="routing.html">
            
                <a href="routing.html">
            
                    
                    Routing
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="topics.html">
            
                <a href="topics.html">
            
                    
                    Topics
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="rpc.html">
            
                <a href="rpc.html">
            
                    
                    RPC
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="publisher_confirms.html">
            
                <a href="publisher_confirms.html">
            
                    
                    Publisher Confirms
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    分布式RabbitMQ(Distributed RabbitMQ)
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="../distribute/overview.html">
            
                <a href="../distribute/overview.html">
            
                    
                    Mirroring, Shovel, Federation Overview
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="../distribute/clustering.html">
            
                <a href="../distribute/clustering.html">
            
                    
                    Clustering
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="../distribute/highly_available.html">
            
                <a href="../distribute/highly_available.html">
            
                    
                    Highly Available
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Publish / Subscribe </a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h4 id="&#x5185;&#x5BB9;&#x6458;&#x8981;">&#x5185;&#x5BB9;&#x6458;&#x8981;</h4>
<blockquote>
<p>In the <a href="https://www.rabbitmq.com/tutorials/tutorial-two-python.html" target="_blank">previous tutorial</a> we created a work queue. The assumption behind a work queue is that each task is delivered to exactly one worker. In this part we&apos;ll do something completely different -- we&apos;ll deliver a message to multiple consumers. This pattern is known as &quot;publish/subscribe&quot;.</p>
<p>To illustrate the pattern, we&apos;re going to build a simple logging system. It will consist of two programs -- the first will emit log messages and the second will receive and print them.</p>
<p>In our logging system every running copy of the receiver program will get the messages. That way we&apos;ll be able to run one receiver and direct the logs to disk; and at the same time we&apos;ll be able to run another receiver and see the logs on the screen.</p>
<p>Essentially, published log messages are going to be broadcast to all the receivers.</p>
</blockquote>
<p>&#x5728;<a href="work_queues.html">&#x524D;&#x9762;</a>&#x7684;&#x6559;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;worker&#x961F;&#x5217;&#x3002;worker&#x961F;&#x5217;&#x80CC;&#x540E;&#x7684;&#x5047;&#x8BBE;&#x662F;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x53EA;&#x4EA4;&#x4ED8;&#x7ED9;&#x4E00;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x505A;&#x4E00;&#x4E9B;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x5C06;&#x5411;&#x591A;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x4F20;&#x9012;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x79F0;&#x4E3A;&#x201C;&#x53D1;&#x5E03;/&#x8BA2;&#x9605;&#x201D;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x8BE5;&#x6A21;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#x3002;&#x5B83;&#x5C06;&#x7531;&#x4E24;&#x4E2A;&#x7A0B;&#x5E8F;&#x7EC4;&#x6210;&#x2014;&#x2014;&#x7B2C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5C06;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x6D88;&#x606F;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7A0B;&#x5E8F;&#x5C06;&#x63A5;&#x6536;&#x5E76;&#x6253;&#x5370;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FD0;&#x884C;&#x7740;&#x7684;&#x63A5;&#x6536;&#x7A0B;&#x5E8F;&#x7684;&#x526F;&#x672C;&#x7684;&#x6D88;&#x8D39;&#x8005;&#x90FD;&#x5C06;&#x83B7;&#x5F97;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x63A5;&#x6536;&#x8005;&#xFF0C;&#x5E76;&#x5C06;&#x65E5;&#x5FD7;&#x5B9A;&#x5411;&#x5230;&#x78C1;&#x76D8;;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x80FD;&#x591F;&#x8FD0;&#x884C;&#x53E6;&#x4E00;&#x4E2A;&#x63A5;&#x6536;&#x8005;&#x5E76;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x770B;&#x5230;&#x65E5;&#x5FD7;&#x3002;</p>
<p>&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x8BB2;&#xFF0C;&#x53D1;&#x5E03;&#x65E5;&#x5FD7;&#x6D88;&#x606F;&#x5C06;&#x5E7F;&#x64AD;&#x7ED9;&#x6240;&#x6709;&#x7684;&#x63A5;&#x6536;&#x8005;&#x3002;</p>
<h4 id="exchanges">Exchanges</h4>
<blockquote>
<p>In previous parts of the tutorial we sent and received messages to and from a queue. Now it&apos;s time to introduce the full messaging model in Rabbit.</p>
<p>Let&apos;s quickly go over what we covered in the previous tutorials:</p>
<ul>
<li>A <em>producer</em> is a user application that sends messages.</li>
<li>A <em>queue</em> is a buffer that stores messages.</li>
<li>A <em>consumer</em> is a user application that receives messages.</li>
</ul>
<p>The core idea in the messaging model in RabbitMQ is that the producer never sends any messages directly to a queue. Actually, quite often the producer doesn&apos;t even know if a message will be delivered to any queue at all.</p>
<p>Instead, the producer can only send messages to an <em>exchange</em>. An exchange is a very simple thing. On one side it receives messages from producers and the other side it pushes them to queues. The exchange must know exactly what to do with a message it receives. Should it be appended to a particular queue? Should it be appended to many queues? Or should it get discarded. The rules for that are defined by the <code>exchange type</code>.</p>
</blockquote>
<p>&#x5FEB;&#x901F;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x4E4B;&#x524D;&#x7684;&#x6559;&#x7A0B;</p>
<ul>
<li>&#x751F;&#x4EA7;&#x8005;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x5E94;&#x7528;&#xFF0C;&#x7528;&#x6765;&#x53D1;&#x9001;&#x6D88;&#x606F;</li>
<li>&#x961F;&#x5217;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x6D88;&#x606F;&#x7684;&#x7F13;&#x5B58;</li>
<li>&#x6D88;&#x8D39;&#x8005;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x5E94;&#x7528;&#xFF0C;&#x7528;&#x6765;&#x63A5;&#x6536;&#x6D88;&#x606F;</li>
</ul>
<p>RabbitMQ&#x6D88;&#x606F;&#x4F20;&#x9012;&#x6A21;&#x578B;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x4ECE;&#x4E0D;&#x76F4;&#x63A5;&#x5411;&#x961F;&#x5217;&#x53D1;&#x9001;&#x4EFB;&#x4F55;&#x6D88;&#x606F;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x751A;&#x81F3;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x6D88;&#x606F;&#x662F;&#x5426;&#x4F1A;&#x88AB;&#x4F20;&#x9012;&#x5230;&#x4EFB;&#x4F55;&#x961F;&#x5217;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x53EA;&#x80FD;&#x5411;<code>exchange</code>&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3002;<code>exchange</code>&#x662F;&#x4E00;&#x4EF6;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4E00;&#x8FB9;&#x63A5;&#x6536;&#x6765;&#x81EA;&#x751F;&#x4EA7;&#x8005;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x53E6;&#x4E00;&#x8FB9;&#x5C06;&#x6D88;&#x606F;&#x63A8;&#x9001;&#x5230;&#x961F;&#x5217;&#x3002;exchange&#x5FC5;&#x987B;&#x786E;&#x5207;&#x5730;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5B83;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6D88;&#x606F;&#x3002;&#x5B83;&#x5E94;&#x8BE5;&#x88AB;&#x9644;&#x52A0;&#x5230;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x961F;&#x5217;&#x5417;?&#x5B83;&#x5E94;&#x8BE5;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x8BB8;&#x591A;&#x961F;&#x5217;&#x4E2D;&#x5417;?&#x6216;&#x8005;&#x5B83;&#x5E94;&#x8BE5;&#x88AB;&#x4E22;&#x5F03;&#x3002;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x7531;<code>exchange_type</code>&#x5B9A;&#x4E49;&#x3002;</p>
<p><img src="images/publish_subscribe.png" alt="publish_subscribe"></p>
<blockquote>
<p>There are a few exchange types available: direct, topic, headers and fanout. We&apos;ll focus on the last one -- the fanout. Let&apos;s create an exchange of that type, and call it logs:</p>
</blockquote>
<p>exchange_type = direct | topic | headers | fanout</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x5173;&#x6CE8;&#x6700;&#x540E;&#x4E00;&#x4E2A;<code>fanout</code></p>
<pre><code class="lang-python">channel.exchange_declare(exchange=<span class="hljs-string">&apos;logs&apos;</span>,
                         exchange_type=<span class="hljs-string">&apos;fanout&apos;</span>)
</code></pre>
<blockquote>
<p>The fanout exchange is very simple. As you can probably guess from the name, it just broadcasts all the messages it receives to all the queues it knows. And that&apos;s exactly what we need for our logger.</p>
</blockquote>
<p><code>fanout</code> &#x53EA;&#x662F;&#x5E7F;&#x64AD;&#x6240;&#x6709;&#x5B83;&#x6536;&#x5230;&#x7684;&#x6D88;&#x606F;&#x5230;&#x5B83;&#x77E5;&#x9053;&#x7684;&#x6240;&#x6709;&#x961F;&#x5217;&#x3002;</p>
<blockquote>
<h4 id="listing-exchanges">Listing exchanges</h4>
<p>To list the exchanges on the server you can run the ever useful rabbitmqctl:</p>
<pre><code class="lang-bash">sudo rabbitmqctl list_exchanges
</code></pre>
<p>In this list there will be some amq.* exchanges and the default (unnamed) exchange. These are created by default, but it is unlikely you&apos;ll need to use them at the moment.</p>
<h4 id="the-default-exchange">The default exchange</h4>
<p>In previous parts of the tutorial we knew nothing about exchanges, but still were able to send messages to queues. That was possible because we were using a default exchange, which we identify by the empty string (&quot;&quot;).</p>
<p>Recall how we published a message before:</p>
<pre><code class="lang-python">channel.basic_publish(exchange=<span class="hljs-string">&apos;&apos;</span>,
                     routing_key=<span class="hljs-string">&apos;hello&apos;</span>,
                     body=message)
</code></pre>
<p>The exchange parameter is the name of the exchange. The empty string denotes the default or <em>nameless</em> exchange: messages are routed to the queue with the name specified by routing_key, if it exists.</p>
</blockquote>
<p>&#x5217;&#x4E3E;exchanges</p>
<p><code>sudo rabbitmqctl list_exchanges</code></p>
<p>&#x5728;&#x4E4B;&#x524D;&#x7684;&#x6559;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x7684;exchange&#xFF0C;&#x7528;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x53C2;&#x6570;exchange&#x662F;<code>exchange</code>&#x7684;&#x540D;&#x5B57;,&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x4EE3;&#x8868;&#x4E86;&#x9ED8;&#x8BA4;&#x503C;&#x6216;&#x8005;&#x65E0;&#x540D;&#x7684;exchange&#xFF0C;&#x6D88;&#x606F;&#x4F1A;&#x88AB;&#x8DEF;&#x7531;&#x5230;&#x548C;routing_key&#x7684;&#x503C;&#x76F8;&#x540C;&#x7684;&#x961F;&#x5217;&#x4E0A;&#x3002;</p>
<pre><code class="lang-python">channel.basic_publish(exchange=<span class="hljs-string">&apos;logs&apos;</span>,
                      routing_key=<span class="hljs-string">&apos;&apos;</span>,
                      body=message)
</code></pre>
<h4 id="&#x4E34;&#x65F6;&#x961F;&#x5217;">&#x4E34;&#x65F6;&#x961F;&#x5217;</h4>
<blockquote>
<p>Temporary queues</p>
<p>As you may remember previously we were using queues that had specific names (remember hello and task_queue?). Being able to name a queue was crucial for us -- we needed to point the workers to the same queue. Giving a queue a name is important when you want to share the queue between producers and consumers.</p>
<p>But that&apos;s not the case for our logger. We want to hear about all log messages, not just a subset of them. We&apos;re also interested only in currently flowing messages not in the old ones. To solve that we need two things.</p>
<p>Firstly, whenever we connect to Rabbit we need a fresh, empty queue. To do it we could create a queue with a random name, or, even better - let the server choose a random queue name for us. We can do this by supplying empty queue parameter to <code>queue_declare</code>:</p>
</blockquote>
<p>&#x4E4B;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x961F;&#x5217;&#x90FD;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x7C7B;&#x4F3C;hello&#xFF0C;task_queue&#x3002;&#x7ED9;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x547D;&#x540D;&#x5BF9;&#x6211;&#x4EEC;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x628A;workers&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x3002;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x5728;&#x6D88;&#x8D39;&#x8005;&#x548C;&#x751F;&#x4EA7;&#x8005;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x961F;&#x5217;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED9;&#x961F;&#x5217;&#x547D;&#x540D;&#x5C31;&#x663E;&#x5F97;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6240;&#x6709;&#x7684;&#x65E5;&#x5FD7;&#x6D88;&#x606F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x5173;&#x5FC3;&#x5F53;&#x524D;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x65E7;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x4E24;&#x4EF6;&#x4E8B;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#x6211;&#x4EEC;&#x8FDE;&#x63A5;&#x5230;Rabbit&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5E72;&#x51C0;&#x7684;&#xFF0C;&#x7A7A;&#x7684;&#x961F;&#x5217;&#x3002;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x540D;&#x5B57;&#x7684;&#x961F;&#x5217;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x597D;&#x4E00;&#x70B9;&#xFF0C;&#x8BA9;&#x670D;&#x52A1;&#x5668;&#x5E2E;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x961F;&#x5217;&#x540D;&#x5B57;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x58F0;&#x660E;<code>queue_declare</code>&#x4E3A;&#x7A7A;&#x3002;</p>
<pre><code class="lang-python">result = channel.queue_declare(queue=<span class="hljs-string">&apos;&apos;</span>)
</code></pre>
<blockquote>
<p>At this point <code>result.method.queue</code> contains a random queue name. For example it may look like amq.gen-JzTY20BRgKO-HjmUJj0wLg.</p>
<p>Secondly, once the consumer connection is closed, the queue should be deleted. There&apos;s an <code>exclusive</code>flag for that:</p>
</blockquote>
<p><code>result.method.queue</code>&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x961F;&#x5217;&#x540D;&#x5B57;&#xFF0C;&#x7C7B;&#x4F3C;&#x8FD9;&#x79CD; <code>amq.gen-JzTY20BRgKO-HjmUJj0wLg</code></p>
<p>&#x518D;&#x8005;&#xFF0C;&#x4E00;&#x5355;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x8FDE;&#x63A5;&#x5173;&#x95ED;&#xFF0C;&#x8FD9;&#x4E2A;&#x961F;&#x5217;&#x5E94;&#x8BE5;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;<code>exclusive=True</code></p>
<pre><code class="lang-python">result = channel.queue_declare(queue=<span class="hljs-string">&apos;&apos;</span>, exclusive=<span class="hljs-keyword">True</span>)
</code></pre>
<blockquote>
<p>You can learn more about the <code>exclusive</code> flag and other queue properties in the <a href="https://www.rabbitmq.com/queues.html" target="_blank">guide on queues</a>.</p>
</blockquote>
<h4 id="bindings">Bindings</h4>
<p>&#x7ED1;&#x5B9A;queue&#x548C;exchange</p>
<pre><code class="lang-python">channel.queue_bind(exchange=<span class="hljs-string">&apos;logs&apos;</span>,
                   queue=result.method.queue)
</code></pre>
<p>&#x5217;&#x51FA;&#x6240;&#x6709;&#x7684;bindings  <code>rabbitmqctl list_bindings</code></p>
<blockquote>
<p>The producer program, which emits log messages, doesn&apos;t look much different from the previous tutorial. The most important change is that we now want to publish messages to our <code>logs</code> exchange instead of the nameless one. We need to supply a <code>routing_key</code> when sending, but its value is ignored for fanout exchanges.</p>
</blockquote>
<p>&#x751F;&#x4EA7;&#x8005;&#x4EE3;&#x7801;&#x548C;&#x4E4B;&#x524D;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x662F;&#x6211;&#x4EEC;&#x751F;&#x4EA7;&#x6D88;&#x606F;&#x5230;<code>exchange=logs</code>, &#x800C;&#x4E0D;&#x662F;<code>exchange=&apos;&apos;</code>, &#x53D1;&#x9001;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x63D0;&#x4F9B;<code>routing_key</code>&#xFF0C;&#x4F46;&#x662F;&#x5728;fanout&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x88AB;&#x5FFD;&#x7565;&#x4E86;&#x3002;</p>
<p><code>emit_log.py</code></p>
<pre><code class="lang-python"><span class="hljs-comment">#!/usr/bin/env python</span>
<span class="hljs-keyword">import</span> pika
<span class="hljs-keyword">import</span> sys

connection = pika.BlockingConnection(
    pika.ConnectionParameters(host=<span class="hljs-string">&apos;localhost&apos;</span>))
channel = connection.channel()

channel.exchange_declare(exchange=<span class="hljs-string">&apos;logs&apos;</span>, exchange_type=<span class="hljs-string">&apos;fanout&apos;</span>)

message = <span class="hljs-string">&apos; &apos;</span>.join(sys.argv[<span class="hljs-number">1</span>:]) <span class="hljs-keyword">or</span> <span class="hljs-string">&quot;info: Hello World!&quot;</span>
channel.basic_publish(exchange=<span class="hljs-string">&apos;logs&apos;</span>, routing_key=<span class="hljs-string">&apos;&apos;</span>, body=message)
print(<span class="hljs-string">&quot; [x] Sent %r&quot;</span> % message)
connection.close()
</code></pre>
<p><code>receive_logs.py</code></p>
<pre><code class="lang-python"><span class="hljs-comment">#!/usr/bin/env python</span>
<span class="hljs-keyword">import</span> pika

connection = pika.BlockingConnection(
    pika.ConnectionParameters(host=<span class="hljs-string">&apos;localhost&apos;</span>))
channel = connection.channel()

channel.exchange_declare(exchange=<span class="hljs-string">&apos;logs&apos;</span>, exchange_type=<span class="hljs-string">&apos;fanout&apos;</span>)

result = channel.queue_declare(queue=<span class="hljs-string">&apos;&apos;</span>, exclusive=<span class="hljs-keyword">True</span>)
queue_name = result.method.queue

channel.queue_bind(exchange=<span class="hljs-string">&apos;logs&apos;</span>, queue=queue_name)

print(<span class="hljs-string">&apos; [*] Waiting for logs. To exit press CTRL+C&apos;</span>)

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">callback</span><span class="hljs-params">(ch, method, properties, body)</span>:</span>
    print(<span class="hljs-string">&quot; [x] %r&quot;</span> % body)

channel.basic_consume(
    queue=queue_name, on_message_callback=callback, auto_ack=<span class="hljs-keyword">True</span>)

channel.start_consuming()
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="work_queues.html" class="navigation navigation-prev " aria-label="Previous page: Work queues">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="routing.html" class="navigation navigation-next " aria-label="Next page: Routing">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Publish / Subscribe ","level":"1.2.3","depth":2,"next":{"title":"Routing","level":"1.2.4","depth":2,"path":"queue/routing.md","ref":"queue/routing.md","articles":[]},"previous":{"title":"Work queues","level":"1.2.2","depth":2,"path":"queue/work_queues.md","ref":"queue/work_queues.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"queue/publish_subscribe.md","mtime":"2020-04-22T08:34:41.674Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-24T03:48:12.552Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

