
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Work queues · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="publish_subscribe.html" />
    
    
    <link rel="prev" href="hello_world.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    开始
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    消息队列模式
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="hello_world.html">
            
                <a href="hello_world.html">
            
                    
                    Hello World
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="work_queues.html">
            
                <a href="work_queues.html">
            
                    
                    Work queues
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="publish_subscribe.html">
            
                <a href="publish_subscribe.html">
            
                    
                    Publish / Subscribe 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="routing.html">
            
                <a href="routing.html">
            
                    
                    Routing
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="topics.html">
            
                <a href="topics.html">
            
                    
                    Topics
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="rpc.html">
            
                <a href="rpc.html">
            
                    
                    RPC
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="publisher_confirms.html">
            
                <a href="publisher_confirms.html">
            
                    
                    Publisher Confirms
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    服务端文档(Server Documentation)
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../server/configuration.md">
            
                <span>
            
                    
                    Configuration
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    分布式RabbitMQ(Distributed RabbitMQ)
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../distribute/overview.html">
            
                <a href="../distribute/overview.html">
            
                    
                    概述（Mirroring, Shovel, Federation Overview）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../distribute/clustering.html">
            
                <a href="../distribute/clustering.html">
            
                    
                    Clustering
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" >
            
                <a target="_blank" href="https://www.rabbitmq.com/ha.html">
            
                    
                    Queue Mirroring
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" >
            
                <a target="_blank" href="https://www.rabbitmq.com/reliability.html">
            
                    
                    Reliable Message Delivery
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" >
            
                <a target="_blank" href="https://www.rabbitmq.com/pacemaker.html">
            
                    
                    highly available
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Work queues</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h4 id="&#x5185;&#x5BB9;&#x6458;&#x8981;">&#x5185;&#x5BB9;&#x6458;&#x8981;</h4>
<blockquote>
<p>In the <a href="https://www.rabbitmq.com/tutorials/tutorial-one-python.html" target="_blank">first tutorial</a> we wrote programs to send and receive messages from a named queue. In this one we&apos;ll create a <em>Work Queue</em> that will be used to distribute time-consuming tasks among multiple workers.</p>
</blockquote>
<p>&#x5728;<a href="hello_world.html">hello_world</a>&#x4E2D;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x4E86;&#x4ECE;&#x6307;&#x5B9A;&#x961F;&#x5217;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;Work Queue&#x5411;&#x591A;&#x4E2A;workers&#x5206;&#x53D1;&#x8017;&#x65F6;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<h4 id="&#x8F6E;&#x8BE2;&#x5206;&#x53D1;">&#x8F6E;&#x8BE2;&#x5206;&#x53D1;</h4>
<blockquote>
<p>Round-robin dispatching</p>
<p>By default, RabbitMQ will send each message to the next consumer, in sequence. On average every consumer will get the same number of messages. This way of distributing messages is called round-robin. </p>
</blockquote>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;RabbitMQ&#x5C06;&#x6309;&#x987A;&#x5E8F;&#x5C06;&#x6BCF;&#x4E2A;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x7ED9;&#x4E0B;&#x4E00;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x3002;&#x5E73;&#x5747;&#x6BCF;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x5C06;&#x5F97;&#x5230;&#x76F8;&#x540C;&#x6570;&#x91CF;&#x7684;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x79CD;&#x5206;&#x53D1;&#x6D88;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#x79F0;&#x4E3A;&#x8F6E;&#x8BE2;&#x3002;</p>
<h4 id="&#x6D88;&#x606F;&#x786E;&#x8BA4;">&#x6D88;&#x606F;&#x786E;&#x8BA4;</h4>
<blockquote>
<p>Message acknowledgment</p>
<p>Doing a task can take a few seconds. You may wonder what happens if one of the consumers starts a long task and dies with it only partly done. With our current code once RabbitMQ delivers message to the consumer it immediately marks it for deletion. In this case, if you kill a worker we will lose the message it was just processing. We&apos;ll also lose all the messages that were dispatched to this particular worker but were not yet handled.</p>
</blockquote>
<p>&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x4F1A;&#x82B1;&#x6389;&#x51E0;&#x79D2;&#x949F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x77E5;&#x9053;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x542F;&#x52A8;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x957F;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x53EA;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x5C31;&#x6302;&#x6389;&#x4E86;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x5F53;&#x524D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;<strong>&#x4E00;&#x65E6;RabbitMQ&#x5C06;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7ED9;&#x6D88;&#x8D39;&#x8005;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x7ACB;&#x5373;&#x5C06;&#x5176;&#x6807;&#x8BB0;&#x4E3A;&#x5220;&#x9664;</strong>&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x6740;&#x6B7B;&#x4E86;&#x4E00;&#x4E2A;worker&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E22;&#x5931;&#x5B83;&#x6B63;&#x5728;&#x5904;&#x7406;&#x7684;&#x6D88;&#x606F;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5C06;&#x4E22;&#x5931;&#x6240;&#x6709;&#x53D1;&#x9001;&#x7ED9;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;worker&#x4F46;&#x5C1A;&#x672A;&#x5904;&#x7406;&#x7684;&#x6D88;&#x606F;&#x3002;</p>
<blockquote>
<p>But we don&apos;t want to lose any tasks. If a worker dies, we&apos;d like the task to be delivered to another worker.</p>
<p>In order to make sure a message is never lost, RabbitMQ supports <a href="https://www.rabbitmq.com/confirms.html" target="_blank">message <em>acknowledgments</em></a>. An ack(nowledgement) is sent back by the consumer to tell RabbitMQ that a particular message had been received, processed and that RabbitMQ is free to delete it.</p>
</blockquote>
<p>&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x6D88;&#x606F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#xFF0C;RabbitMQ&#x652F;&#x6301;<a href="https://www.rabbitmq.com/confirms.html" target="_blank">message_acknowledgments</a>&#x3002;&#x6D88;&#x8D39;&#x8005;&#x53D1;&#x9001;&#x4E00;&#x4E2A;ack(nowledgement)&#x6765;&#x544A;&#x8BC9;RabbitMQ&#xFF0C;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x6D88;&#x606F;&#x5DF2;&#x7ECF;&#x88AB;&#x63A5;&#x6536;&#x3001;&#x5904;&#x7406;&#xFF0C;RabbitMQ&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x5220;&#x9664;&#x5B83;&#x3002;</p>
<blockquote>
<p>If a consumer dies (its channel is closed, connection is closed, or TCP connection is lost) without sending an ack, RabbitMQ will understand that a message wasn&apos;t processed fully and will re-queue it. If there are other consumers online at the same time, it will then quickly redeliver it to another consumer. That way you can be sure that no message is lost, even if the workers occasionally die.</p>
</blockquote>
<p>&#x5982;&#x679C;&#x6D88;&#x8D39;&#x8005;&#x5728;&#x4E0D;&#x53D1;&#x9001;ack&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6B7B;&#x4EA1;(&#x5176;&#x901A;&#x9053;&#x5173;&#x95ED;&#x3001;&#x8FDE;&#x63A5;&#x5173;&#x95ED;&#x6216;TCP&#x8FDE;&#x63A5;&#x4E22;&#x5931;)&#xFF0C;RabbitMQ&#x5C06;&#x4F1A;&#x77E5;&#x9053;&#x6D88;&#x606F;&#x672A;&#x88AB;&#x5B8C;&#x5168;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x5C06;&#x91CD;&#x65B0;&#x628A;&#x5B83;&#x653E;&#x8FDB;&#x961F;&#x5217;&#x3002;&#x5982;&#x679C;&#x540C;&#x65F6;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x6D88;&#x8D39;&#x8005;&#x5728;&#x7EBF;&#xFF0C;&#x5B83;&#x4F1A;&#x5F88;&#x5FEB;&#x5C06;&#x5176;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x6CA1;&#x6709;&#x4FE1;&#x606F;&#x4E22;&#x5931;&#xFF0C;&#x5373;&#x4F7F;&#x6D88;&#x8D39;&#x8005;&#x5076;&#x5C14;&#x6302;&#x6389;&#x3002;</p>
<blockquote>
<p>There aren&apos;t any message timeouts; RabbitMQ will redeliver the message when the consumer dies. It&apos;s fine even if processing a message takes a very, very long time.</p>
<p><a href="https://www.rabbitmq.com/confirms.html" target="_blank">Manual message acknowledgments</a> are turned on by default. In previous examples we explicitly turned them off via the auto_ack=True flag. It&apos;s time to remove this flag and send a proper acknowledgment from the worker, once we&apos;re done with a task.</p>
</blockquote>
<p>&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6D88;&#x606F;&#x4F1A;&#x8D85;&#x65F6;;&#x5F53;&#x6D88;&#x8D39;&#x8005;&#x6302;&#x6389;&#x65F6;&#xFF0C;RabbitMQ&#x5C06;&#x91CD;&#x65B0;&#x4F20;&#x9012;&#x6D88;&#x606F;&#x3002;&#x5373;&#x4F7F;&#x5904;&#x7406;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x9700;&#x8981;&#x5F88;&#x957F;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x81EA;&#x52A8;&#x6D88;&#x606F;&#x786E;&#x8BA4;&#x9ED8;&#x8BA4;&#x88AB;&#x6253;&#x5F00;&#x3002;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;auto_ack=True&#x6765;&#x5173;&#x95ED;&#x81EA;&#x52A8;&#x786E;&#x8BA4;&#x3002;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x79FB;&#x9664;&#x8FD9;&#x4E2A;&#x6807;&#x5FD7;&#x5E76;&#x4ECE;&#x6D88;&#x8D39;&#x8005;&#x90A3;&#x91CC;&#x53D1;&#x9001;&#x4E00;&#x4E2A;ack&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">callback</span><span class="hljs-params">(ch, method, properties, body)</span>:</span>
    print(<span class="hljs-string">&quot; [x] Received %r&quot;</span> % body)
    time.sleep(body.count(<span class="hljs-string">&apos;.&apos;</span>))
    print(<span class="hljs-string">&quot; [x] Done&quot;</span>)
    ch.basic_ack(delivery_tag=method.delivery_tag)

channel.basic_consume(queue=<span class="hljs-string">&apos;hello&apos;</span>, on_message_callback=callback)
</code></pre>
<blockquote>
<p>Using this code we can be sure that even if you kill a worker using CTRL+C while it was processing a message, nothing will be lost. Soon after the worker dies all unacknowledged messages will be redelivered.</p>
<p>Acknowledgement must be sent on the same channel that received the delivery. Attempts to acknowledge using a different channel will result in a channel-level protocol exception. See the <a href="https://www.rabbitmq.com/confirms.html" target="_blank">doc guide on confirmations</a> to learn more.</p>
</blockquote>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x5373;&#x4F7F;&#x4F60;&#x5728;&#x5904;&#x7406;&#x6D88;&#x606F;&#x65F6;&#x4F7F;&#x7528;CTRL+C&#x6740;&#x6B7B;&#x4E86;&#x6D88;&#x8D39;&#x8005;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x4EFB;&#x4F55;&#x6D88;&#x606F;&#x3002;&#x5728;&#x6D88;&#x8D39;&#x8005;&#x6B7B;&#x540E;&#x4E0D;&#x4E45;&#xFF0C;&#x6240;&#x6709;&#x672A;&#x786E;&#x8BA4;&#x7684;&#x6D88;&#x606F;&#x5C06;&#x88AB;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x3002;</p>
<p>ack&#x5FC5;&#x987B;&#x5728;&#x63A5;&#x6536;&#x7684;&#x540C;&#x4E00;&#x901A;&#x9053;&#x4E0A;&#x53D1;&#x9001;&#x3002;&#x5C1D;&#x8BD5;&#x786E;&#x8BA4;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x4FE1;&#x9053;&#x5C06;&#x5BFC;&#x81F4;&#x4FE1;&#x9053;&#x7EA7;&#x534F;&#x8BAE;&#x5F02;&#x5E38;&#x3002;&#x8BF7;&#x53C2;&#x9605;<a href="https://www.rabbitmq.com/confirms.html" target="_blank">&#x5173;&#x4E8E;confirmations&#x7684;doc&#x6307;&#x5357;</a>&#x4EE5;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;</p>
<blockquote>
<blockquote>
<p> Forgotten acknowledgment</p>
</blockquote>
<p>It&apos;s a common mistake to miss the basic_ack. It&apos;s an easy error, but the consequences are serious. Messages will be redelivered when your client quits (which may look like random redelivery), but RabbitMQ will eat more and more memory as it won&apos;t be able to release any unacked messages.In order to debug this kind of mistake you can use rabbitmqctl to print the messages_unacknowledged field:</p>
<p><code>sudo rabbitmqctl list_queues name messages_ready messages_unacknowledged</code></p>
</blockquote>
<p>&#x5FD8;&#x8BB0;basic_ack&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x6613;&#x72AF;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x540E;&#x679C;&#x662F;&#x4E25;&#x91CD;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x9000;&#x51FA;&#x65F6;&#xFF0C;&#x6D88;&#x606F;&#x5C06;&#x88AB;&#x91CD;&#x65B0;&#x53D1;&#x9001;(&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x968F;&#x673A;&#x7684;&#x91CD;&#x65B0;&#x53D1;&#x9001;)&#xFF0C;&#x4F46;&#x662F;RabbitMQ&#x5C06;&#x6D88;&#x8017;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x65E0;&#x6CD5;&#x91CA;&#x653E;&#x4EFB;&#x4F55;&#x672A;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x3002;&#x4E3A;&#x4E86;&#x8C03;&#x8BD5;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;rabbitmqctl&#x6765;&#x6253;&#x5370;messages_unacknowledged&#x5B57;&#x6BB5;&#x3002;</p>
<h4 id="&#x6D88;&#x606F;&#x6301;&#x4E45;&#x5316;">&#x6D88;&#x606F;&#x6301;&#x4E45;&#x5316;</h4>
<blockquote>
<p>Message durability</p>
<p>We have learned how to make sure that even if the consumer dies, the task isn&apos;t lost. But our tasks will still be lost if RabbitMQ server stops.</p>
<p>When RabbitMQ quits or crashes it will forget the queues and messages unless you tell it not to. Two things are required to make sure that messages aren&apos;t lost: we need to mark both the queue and messages as durable.</p>
<p>First, we need to make sure that the queue will survive a RabbitMQ node restart. In order to do so, we need to declare it as <code>durable</code>:</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B66;&#x4F1A;&#x4E86;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x6D88;&#x8D39;&#x8005;&#x6302;&#x6389;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EFB;&#x52A1;&#x4E0D;&#x4F1A;&#x4E22;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;RabbitMQ&#x6302;&#x6389;&#xFF0C;&#x6D88;&#x606F;&#x4ECD;&#x7136;&#x4F1A;&#x4E22;&#x5931;&#x3002;</p>
<p>&#x5F53;RabbitMQ&#x9000;&#x51FA;&#x6216;&#x5D29;&#x6E83;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x4E22;&#x5931;&#x961F;&#x5217;&#x548C;&#x6D88;&#x606F;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x544A;&#x8BC9;&#x5B83;&#x4E0D;&#x8981;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x786E;&#x4FDD;&#x6D88;&#x606F;&#x4E0D;&#x4E22;&#x5931;&#x9700;&#x8981;&#x505A;&#x4E24;&#x4EF6;&#x4E8B;:&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x961F;&#x5217;&#x548C;&#x6D88;&#x606F;&#x90FD;&#x6807;&#x8BB0;&#x4E3A;&#x6301;&#x4E45;&#x7684;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;<strong>&#x786E;&#x4FDD;&#x961F;&#x5217;&#x5728;RabbitMQ&#x8282;&#x70B9;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x540E;&#x4ECD;&#x7136;&#x5B58;&#x5728;</strong>&#x3002;&#x4E3A;&#x4E86;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x58F0;&#x660E;&#x5B83;&#x4E3A;<strong>durable</strong>:</p>
<pre><code class="lang-python">channel.queue_declare(queue=<span class="hljs-string">&apos;hello&apos;</span>, durable=<span class="hljs-keyword">True</span>)
</code></pre>
<blockquote>
<p>Although this command is correct by itself, it won&apos;t work in our setup. That&apos;s because we&apos;ve already defined a queue called hello which is not durable. RabbitMQ doesn&apos;t allow you to redefine an existing queue with different parameters and will return an error to any program that tries to do that. But there is a quick workaround - let&apos;s declare a queue with different name, for example <code>task_queue</code>:</p>
</blockquote>
<p>&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x672C;&#x8EAB;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x8BBE;&#x7F6E;&#x5374;&#x4E0D;&#x80FD;&#x5DE5;&#x4F5C;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;hello&#x7684;&#x961F;&#x5217;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x6301;&#x4E45;&#x7684;&#x3002;RabbitMQ&#x4E0D;&#x5141;&#x8BB8;&#x4F60;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x73B0;&#x6709;&#x961F;&#x5217;&#xFF0C;&#x5E76;&#x5C06;&#x5411;&#x4EFB;&#x4F55;&#x8BD5;&#x56FE;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x7A0B;&#x5E8F;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x3002;&#x4F46;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x2014;&#x2014;&#x8BA9;&#x6211;&#x4EEC;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x540D;&#x79F0;&#x7684;&#x961F;&#x5217;&#xFF0C;&#x4F8B;&#x5982;task_queue:</p>
<pre><code class="lang-python">channel.queue_declare(queue=<span class="hljs-string">&apos;task_queue&apos;</span>, durable=<span class="hljs-keyword">True</span>)
</code></pre>
<blockquote>
<p>This <code>queue_declare</code> change needs to be applied to both the producer and consumer code.</p>
<p>At that point we&apos;re sure that the <code>task_queue</code> queue won&apos;t be lost even if RabbitMQ restarts. Now we need to mark our messages as persistent - by supplying a <code>delivery_mode</code> property with a value 2.</p>
</blockquote>
<p>&#x5728;&#x6D88;&#x8D39;&#x8005;&#x548C;&#x751F;&#x4EA7;&#x8005;&#x4E2D;&#x90FD;&#x5E94;&#x8BE5;&#x58F0;&#x660E;<code>queue_declare</code>&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x80FD;&#x786E;&#x4FDD;RabbitMq&#x91CD;&#x542F;&#x540E;&#xFF0C;&#x961F;&#x5217;&#x4E0D;&#x4E22;&#x5931;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA9;&#x6D88;&#x606F;&#x4E5F;&#x80FD;&#x6301;&#x4E45;&#x5316;&#xFF0C;&#x901A;&#x8FC7;&#x4F20;&#x9012;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;<code>delivery_mode=2</code></p>
<pre><code class="lang-python">channel.basic_publish(exchange=<span class="hljs-string">&apos;&apos;</span>,
                      routing_key=<span class="hljs-string">&quot;task_queue&quot;</span>,
                      body=message,
                      properties=pika.BasicProperties(
                         delivery_mode=<span class="hljs-number">2</span>, <span class="hljs-comment"># make message persistent</span>
                      ))
</code></pre>
<h5 id="note-&#x6D88;&#x606F;&#x6301;&#x4E45;&#x5316;">note: &#x6D88;&#x606F;&#x6301;&#x4E45;&#x5316;</h5>
<blockquote>
<p>Note on message persistence</p>
<p>Marking messages as persistent doesn&apos;t fully guarantee that a message won&apos;t be lost. Although it tells RabbitMQ to save the message to disk, there is still a short time window when RabbitMQ has accepted a message and hasn&apos;t saved it yet. Also, RabbitMQ doesn&apos;t do<code>fsync(2)</code> for every message -- it may be just saved to cache and not really written to the disk. The persistence guarantees aren&apos;t strong, but it&apos;s more than enough for our simple task queue. If you need a stronger guarantee then you can use <a href="https://www.rabbitmq.com/confirms.html" target="_blank">publisher confirms</a>.</p>
</blockquote>
<p>&#x5C06;&#x6D88;&#x606F;&#x6807;&#x8BB0;&#x4E3A;&#x6301;&#x4E45;&#x6027;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x4FDD;&#x8BC1;&#x6D88;&#x606F;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x3002;&#x867D;&#x7136;&#x5B83;&#x544A;&#x8BC9;RabbitMQ&#x5C06;&#x6D88;&#x606F;&#x4FDD;&#x5B58;&#x5230;&#x78C1;&#x76D8;&#xFF0C;&#x4F46;&#x662F;&#x5F53;RabbitMQ&#x63A5;&#x53D7;&#x4E86;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x5E76;&#x4E14;&#x8FD8;&#x6CA1;&#x6709;&#x4FDD;&#x5B58;&#x5B83;&#x65F6;&#xFF0C;&#x4ECD;&#x7136;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x77ED;&#x65F6;&#x95F4;&#x7A97;&#x53E3;&#x3002;&#x6B64;&#x5916;&#xFF0C;RabbitMQ&#x4E0D;&#x4F1A;&#x5BF9;&#x6BCF;&#x6761;&#x6D88;&#x606F;&#x90FD;&#x6267;&#x884C;<code>fsync(2)</code>&#x2014;&#x2014;&#x5B83;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x88AB;&#x4FDD;&#x5B58;&#x5230;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x5199;&#x5230;&#x78C1;&#x76D8;&#x4E0A;&#x3002;&#x6301;&#x4E45;&#x6027;&#x4FDD;&#x8BC1;&#x5E76;&#x4E0D;&#x5F3A;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x7B80;&#x5355;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x6765;&#x8BF4;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x66F4;&#x5F3A;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<a href="https://www.rabbitmq.com/confirms.html" target="_blank">publisher confirm</a>&#x3002;</p>
<h4 id="&#x516C;&#x5E73;&#x5206;&#x914D;">&#x516C;&#x5E73;&#x5206;&#x914D;</h4>
<blockquote>
<p>Fair dispatch</p>
<p>You might have noticed that the dispatching still doesn&apos;t work exactly as we want. For example in a situation with two workers, when all odd messages are heavy and even messages are light, one worker will be constantly busy and the other one will do hardly any work. Well, RabbitMQ doesn&apos;t know anything about that and will still dispatch messages evenly.</p>
<p>This happens because RabbitMQ just dispatches a message when the message enters the queue. It doesn&apos;t look at the number of unacknowledged messages for a consumer. It just blindly dispatches every n-th message to the n-th consumer.</p>
</blockquote>
<p>&#x60A8;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x8C03;&#x5EA6;&#x4ECD;&#x7136;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x6309;&#x7167;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7684;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x4E24;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x6240;&#x6709;&#x5947;&#x6570;&#x7684;&#x6D88;&#x606F;&#x90FD;&#x5F88;&#x8017;&#x65F6;&#xFF0C;&#x5076;&#x6570;&#x7684;&#x6D88;&#x606F;&#x90FD;&#x5F88;&#x8F7B;&#xFF0C;&#x4E00;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x4F1A;&#x4E00;&#x76F4;&#x5F88;&#x5FD9;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x51E0;&#x4E4E;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x505A;&#x3002;RabbitMQ&#x5BF9;&#x6B64;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#xFF0C;&#x4ECD;&#x7136;&#x4F1A;&#x5747;&#x5300;&#x5730;&#x5206;&#x53D1;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x56E0;&#x4E3A;RabbitMQ&#x53EA;&#x5728;&#x6D88;&#x606F;&#x8FDB;&#x5165;&#x961F;&#x5217;&#x65F6;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3002;&#x5B83;&#x4E0D;&#x4F1A;&#x67E5;&#x770B;&#x6D88;&#x8D39;&#x8005;&#x672A;&#x786E;&#x8BA4;&#x7684;&#x6D88;&#x606F;&#x7684;&#x6570;&#x91CF;&#x3002;&#x5B83;&#x53EA;&#x662F;&#x76F2;&#x76EE;&#x5730;&#x5C06;&#x7B2C;n&#x6761;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x7ED9;&#x7B2C;n&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x3002;</p>
<blockquote>
<p>In order to defeat that we can use the Channel#basic_qos channel method with the <code>prefetch_count=1</code> setting. This uses the <code>basic.qos</code> protocol method to tell RabbitMQ not to give more than one message to a worker at a time. Or, in other words, don&apos;t dispatch a new message to a worker until it has processed and acknowledged the previous one. Instead, it will dispatch it to the next worker that is not still busy.</p>
</blockquote>
<pre><code class="lang-python">channel.basic_qos(prefetch_count=<span class="hljs-number">1</span>)
</code></pre>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>channel.basic_qos</code>&#x901A;&#x9053;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x8BBE;<code>prefetch_count=1</code>&#x3002;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x7684;&#x662F;<code>basic.qos</code>&#x7684;&#x534F;&#x8BAE;&#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x544A;&#x8BC9;RabbitMQ&#x4E00;&#x6B21;&#x4E0D;&#x8981;&#x5411;&#x4E00;&#x4E2A;worker&#x53D1;&#x9001;&#x591A;&#x4E2A;&#x6D88;&#x606F;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5728;&#x6D88;&#x8D39;&#x8005;&#x5904;&#x7406;&#x5E76;&#x786E;&#x8BA4;&#x524D;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#x8981;&#x5411;&#x5176;&#x53D1;&#x9001;&#x65B0;&#x6D88;&#x606F;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x5C06;&#x628A;&#x5B83;&#x53D1;&#x9001;&#x7ED9;&#x4E0B;&#x4E00;&#x4E2A;&#x4E0D;&#x592A;&#x5FD9;&#x7684;&#x6D88;&#x8D39;&#x8005;&#x3002;</p>
<h5 id="note-&#x961F;&#x5217;&#x5927;&#x5C0F;">note: &#x961F;&#x5217;&#x5927;&#x5C0F;</h5>
<blockquote>
<p>Note about queue size</p>
<p>If all the workers are busy, your queue can fill up. You will want to keep an eye on that, and maybe add more workers, or use <a href="https://www.rabbitmq.com/ttl.html" target="_blank">message TTL</a>.</p>
</blockquote>
<p>&#x5982;&#x679C;&#x6240;&#x6709;&#x7684;&#x6D88;&#x8D39;&#x8005;&#x90FD;&#x5F88;&#x5FD9;&#xFF0C;&#x4F60;&#x7684;&#x961F;&#x5217;&#x4F1A;&#x6392;&#x6EE1;&#x3002;&#x80FD;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8005;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x6D88;&#x8D39;&#x8005;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;<a href="https://www.rabbitmq.com/ttl.html" target="_blank">message TTL</a>(&#x6D88;&#x606F;TTL)&#x3002;</p>
<p><code>new_task.py</code></p>
<pre><code class="lang-python"><span class="hljs-comment">#!/usr/bin/env python</span>
<span class="hljs-keyword">import</span> pika
<span class="hljs-keyword">import</span> sys

connection = pika.BlockingConnection(
    pika.ConnectionParameters(host=<span class="hljs-string">&apos;localhost&apos;</span>))
channel = connection.channel()

channel.queue_declare(queue=<span class="hljs-string">&apos;task_queue&apos;</span>, durable=<span class="hljs-keyword">True</span>)

message = <span class="hljs-string">&apos; &apos;</span>.join(sys.argv[<span class="hljs-number">1</span>:]) <span class="hljs-keyword">or</span> <span class="hljs-string">&quot;Hello World!&quot;</span>
channel.basic_publish(
    exchange=<span class="hljs-string">&apos;&apos;</span>,
    routing_key=<span class="hljs-string">&apos;task_queue&apos;</span>,
    body=message,
    properties=pika.BasicProperties(
        delivery_mode=<span class="hljs-number">2</span>,  <span class="hljs-comment"># make message persistent</span>
    ))
print(<span class="hljs-string">&quot; [x] Sent %r&quot;</span> % message)
connection.close()
</code></pre>
<p><code>worker.py</code></p>
<pre><code class="lang-python"><span class="hljs-comment">#!/usr/bin/env python</span>
<span class="hljs-keyword">import</span> pika
<span class="hljs-keyword">import</span> time

connection = pika.BlockingConnection(
    pika.ConnectionParameters(host=<span class="hljs-string">&apos;localhost&apos;</span>))
channel = connection.channel()

channel.queue_declare(queue=<span class="hljs-string">&apos;task_queue&apos;</span>, durable=<span class="hljs-keyword">True</span>)
print(<span class="hljs-string">&apos; [*] Waiting for messages. To exit press CTRL+C&apos;</span>)


<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">callback</span><span class="hljs-params">(ch, method, properties, body)</span>:</span>
    print(<span class="hljs-string">&quot; [x] Received %r&quot;</span> % body)
    time.sleep(body.count(<span class="hljs-string">b&apos;.&apos;</span>))
    print(<span class="hljs-string">&quot; [x] Done&quot;</span>)
    ch.basic_ack(delivery_tag=method.delivery_tag)


channel.basic_qos(prefetch_count=<span class="hljs-number">1</span>)
channel.basic_consume(queue=<span class="hljs-string">&apos;task_queue&apos;</span>, on_message_callback=callback)

channel.start_consuming()
</code></pre>
<blockquote>
<p>Using <code>message acknowledgments</code> and <code>prefetch_count</code> you can set up a work queue. The durability options let the tasks survive even if RabbitMQ is restarted.</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="hello_world.html" class="navigation navigation-prev " aria-label="Previous page: Hello World">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="publish_subscribe.html" class="navigation navigation-next " aria-label="Next page: Publish / Subscribe ">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Work queues","level":"1.2.2","depth":2,"next":{"title":"Publish / Subscribe ","level":"1.2.3","depth":2,"path":"queue/publish_subscribe.md","ref":"queue/publish_subscribe.md","articles":[]},"previous":{"title":"Hello World","level":"1.2.1","depth":2,"path":"queue/hello_world.md","ref":"queue/hello_world.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"queue/work_queues.md","mtime":"2020-04-22T03:31:32.311Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-23T02:22:03.678Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

